Revit 2027 API
ParameterTypeId.StairsTotalNumberOfTreads Property
 "Total Number of Treads": Total number of treads
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsTotalNumberOfTreads { get; }
Public Shared ReadOnly Property StairsTotalNumberOfTreads As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsTotalNumberOfTreads {
	ForgeTypeId^ get ();
}
static member StairsTotalNumberOfTreads : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace